{"cells":[{"cell_type":"code","execution_count":null,"metadata":{"id":"fIdOtU4GWwrQ","outputId":"d3365b19-ce4d-440d-c0a8-db7302cd25b1"},"outputs":[{"name":"stdout","output_type":"stream","text":["Collecting py2neo\n","  Using cached py2neo-2021.2.3-py2.py3-none-any.whl (177 kB)\n","Collecting monotonic\n","  Using cached monotonic-1.6-py2.py3-none-any.whl (8.2 kB)\n","Collecting interchange~=2021.0.4\n","  Using cached interchange-2021.0.4-py2.py3-none-any.whl (28 kB)\n","Requirement already satisfied: pygments>=2.0.0 in c:\\users\\jack\\anaconda3\\lib\\site-packages (from py2neo) (2.11.2)\n","Collecting pansi>=2020.7.3\n","  Using cached pansi-2020.7.3-py2.py3-none-any.whl (10 kB)\n","Requirement already satisfied: urllib3 in c:\\users\\jack\\anaconda3\\lib\\site-packages (from py2neo) (1.26.14)\n","Requirement already satisfied: certifi in c:\\users\\jack\\anaconda3\\lib\\site-packages (from py2neo) (2022.12.7)\n","Requirement already satisfied: packaging in c:\\users\\jack\\anaconda3\\lib\\site-packages (from py2neo) (22.0)\n","Requirement already satisfied: six>=1.15.0 in c:\\users\\jack\\anaconda3\\lib\\site-packages (from py2neo) (1.16.0)\n","Requirement already satisfied: pytz in c:\\users\\jack\\anaconda3\\lib\\site-packages (from interchange~=2021.0.4->py2neo) (2022.7)\n","Installing collected packages: monotonic, pansi, interchange, py2neo\n","Successfully installed interchange-2021.0.4 monotonic-1.6 pansi-2020.7.3 py2neo-2021.2.3\n"]}],"source":["!pip install py2neo"]},{"cell_type":"code","execution_count":null,"metadata":{"id":"VRZIDwW6WwrU"},"outputs":[],"source":["import pandas as pd\n","from py2neo import Graph\n","from typing import Union\n","graph= Graph(\"bolt://localhost:7687\",password=\"**********\",name=\"neo4j\")"]},{"cell_type":"markdown","metadata":{"id":"hO-Bp3WgWwrW"},"source":["## Load Data to Neo4j"]},{"cell_type":"code","execution_count":null,"metadata":{"id":"-APcoh82WwrX"},"outputs":[],"source":["#Create Indices for each node entity to decrease runing time\n","graph.run(\"\"\" CREATE INDEX CompanyNameIndex IF NOT EXISTS FOR (p:Company) ON (p.id) \"\"\")"]},{"cell_type":"code","execution_count":null,"metadata":{"id":"54wlfDmKWwrY"},"outputs":[],"source":["#Creating nodes\n","#Adjust for each node type\n","graph.run(\"\"\" load csv with headers from \"file:///entities.csv\" as csvline\n","create (n:Company{name:csvline.company,id:csvline.company_id}) \"\"\")"]},{"cell_type":"code","execution_count":null,"metadata":{"id":"AHIKtHkuWwrY"},"outputs":[],"source":["#Creating Edges\n","#Adjust for each edge type\n","graph.run(\"\"\" CALL apoc.periodic.iterate(\"CALL apoc.load.csv('file:///entities.csv') yield map as line return line\",\n","\"WITH line.company AS sID,  line.sectory AS sector match (n:Company{name:sID}),(t:Sector{name:sector})\n","merge (n)-[r:BELONGS_TO]->(t)\",{batchSize:1000, iterateList:true,parallel:false})\n"," \"\"\")"]},{"cell_type":"code","execution_count":null,"metadata":{"id":"T3kR73MmWwrZ"},"outputs":[],"source":["graph.run(\"\"\"CALL apoc.periodic.iterate(\"CALL apoc.load.csv('file:///suppliers.csv') yield map as line return line\",\n","\"WITH toInteger(line.source_id) AS sID, line.start_date\t as date,line.revenue_pct as revenue,\n","toInteger(line.target_id) AS tID match (n:Company{id:sID}),(t:Company{id:tID})\n","merge (n)-[r:SUPPLIES{start_date:date, revenue: revenue}]->(t)\",{batchSize:1000, iterateList:true,parallel:false})\n","\"\"\")"]},{"cell_type":"markdown","metadata":{"id":"0KKVDFfJWwra"},"source":["## Exploring The Network"]},{"cell_type":"code","execution_count":null,"metadata":{"id":"_dV66otEWwra","outputId":"c628a852-3f0c-4698-c6c1-c8d7a8ccf7da"},"outputs":[{"data":{"text/html":["<table><tr><th>numedge</th><th>numNode</th><th>numEdge</th><th>AvgDegree</th></tr><tr><td style=\"text-align:right\">9</td><td style=\"text-align:right\">237431</td><td style=\"text-align:right\">1739156</td><td style=\"text-align:right\">7.0</td></tr></table>"],"text/plain":[" numedge | numNode | numEdge | AvgDegree \n","---------|---------|---------|-----------\n","       9 |  237431 | 1739156 |       7.0 "]},"execution_count":6,"metadata":{},"output_type":"execute_result"}],"source":["#Explore Graph metrics\n","graph.run(\"\"\"MATCH (p)-[r]-(c)\n","RETURN COUNT( distinct type(r)) AS numedge, count(distinct p) as numNode,\n","COUNT( distinct r) AS numEdge, toFloat((count(distinct r)/COUNT( distinct p))) as AvgDegree\"\"\")"]},{"cell_type":"code","execution_count":null,"metadata":{"id":"meyxFjr7Wwrb","outputId":"527b15b5-b566-4b0c-f623-6edc214915df"},"outputs":[{"data":{"text/html":["<table><tr><th>count(n)</th></tr><tr><td style=\"text-align:right\">81784</td></tr></table>"],"text/plain":[" count(n) \n","----------\n","    81784 "]},"execution_count":8,"metadata":{},"output_type":"execute_result"}],"source":["#Isolated nodes\n","graph.run(\"\"\"match (n:Company)\n","where not EXISTS((n)--(:Company))\n","return count(n)\n","\"\"\")"]},{"cell_type":"code","execution_count":null,"metadata":{"id":"60meJKXVWwrc","outputId":"9afc3df4-c31b-4652-8adf-ed4b851c79cd"},"outputs":[{"data":{"text/html":["<table><tr><th>Sector</th><th>RingSize</th></tr><tr><td style=\"text-align:left\">(_237329:Sector {name: &#039;Finance&#039;})</td><td style=\"text-align:right\">42030</td></tr><tr><td style=\"text-align:left\">(_237324:Sector {name: &#039;Technology Services&#039;})</td><td style=\"text-align:right\">22946</td></tr><tr><td style=\"text-align:left\">(_237328:Sector {name: &#039;Producer Manufacturing&#039;})</td><td style=\"text-align:right\">18637</td></tr></table>"],"text/plain":[" Sector                                            | RingSize \n","---------------------------------------------------|----------\n"," (_237329:Sector {name: 'Finance'})                |    42030 \n"," (_237324:Sector {name: 'Technology Services'})    |    22946 \n"," (_237328:Sector {name: 'Producer Manufacturing'}) |    18637 "]},"execution_count":2,"metadata":{},"output_type":"execute_result"}],"source":["graph.run(\"\"\"MATCH (c:Company)-[]->(s:Sector)\n","WITH s as Sector, count(c) AS RingSize\n","WHERE RingSize >1\n","RETURN Sector,RingSize ORDER BY RingSize DESC\"\"\")"]},{"cell_type":"code","execution_count":null,"metadata":{"id":"FSvsAa6iWwrd","outputId":"a338367f-228e-4c7d-a0e3-d8f2adeb649f"},"outputs":[{"data":{"text/html":["<table><tr><th>p</th><th>numParent</th></tr><tr><td style=\"text-align:left\">(_235922:Company {id: 336894, name: &#039;Government of China&#039;})</td><td style=\"text-align:right\">1617</td></tr><tr><td style=\"text-align:left\">(_236091:Company {id: 336913, name: &#039;Government of India&#039;})</td><td style=\"text-align:right\">185</td></tr><tr><td style=\"text-align:left\">(_236146:Company {id: 336951, name: &#039;Government of Russia&#039;})</td><td style=\"text-align:right\">173</td></tr></table>"],"text/plain":[" p                                                            | numParent \n","--------------------------------------------------------------|-----------\n"," (_235922:Company {id: 336894, name: 'Government of China'})  |      1617 \n"," (_236091:Company {id: 336913, name: 'Government of India'})  |       185 \n"," (_236146:Company {id: 336951, name: 'Government of Russia'}) |       173 "]},"execution_count":11,"metadata":{},"output_type":"execute_result"}],"source":["graph.run(\"\"\"MATCH (p:Company)-[r:ULTIMATE_PARENT_OF]->(c:Company)\n","RETURN p, COUNT(r) AS numParent\n","ORDER BY numParent DESC LIMIT 10\"\"\")"]},{"cell_type":"markdown","metadata":{"id":"tYFkQDrNWwre"},"source":["## Preprocessing"]},{"cell_type":"code","execution_count":null,"metadata":{"id":"WcdzLDa2Wwre","outputId":"fc686425-95d2-4da5-a4ca-f2c7e3d38ddc"},"outputs":[{"data":{"text/html":["<table><tr><th>nodeQuery</th><th>relationshipQuery</th><th>graphName</th><th>nodeCount</th><th>relationshipCount</th><th>projectMillis</th></tr><tr><td style=\"text-align:left\">MATCH (n)\n","   RETURN\n","    id(n) AS id,\n","    labels(n) AS labels</td><td style=\"text-align:left\">MATCH (n)-[r:SUPPLIES]-&gt;(m) RETURN id(n) AS source, id(m) AS target, type(r) AS type</td><td style=\"text-align:left\">graphSupply</td><td style=\"text-align:right\">237431</td><td style=\"text-align:right\">214935</td><td style=\"text-align:right\">3884</td></tr></table>"],"text/plain":[" nodeQuery               | relationshipQuery                                                                    | graphName   | nodeCount | relationshipCount | projectMillis \n","-------------------------|--------------------------------------------------------------------------------------|-------------|-----------|-------------------|---------------\n"," MATCH (n)               | MATCH (n)-[r:SUPPLIES]->(m) RETURN id(n) AS source, id(m) AS target, type(r) AS type | graphSupply |    237431 |            214935 |          3884 \n","    RETURN               |                                                                                      |             |           |                   |               \n","     id(n) AS id,        |                                                                                      |             |           |                   |               \n","     labels(n) AS labels |                                                                                      |             |           |                   |               "]},"execution_count":3,"metadata":{},"output_type":"execute_result"}],"source":["#Graph Projection\n","graph.run(\"\"\"CALL gds.graph.project.cypher('graphSupply',\n","  'MATCH (n)\n","   RETURN\n","    id(n) AS id,\n","    labels(n) AS labels',\n","  'MATCH (n)-[r:SUPPLIES]->(m) RETURN id(n) AS source, id(m) AS target, type(r) AS type')\"\"\")"]},{"cell_type":"code","execution_count":null,"metadata":{"id":"ZJYsgwo9Wwrf","outputId":"b8a2ed54-5911-47bc-d6da-cbd5c85000f4"},"outputs":[{"data":{"text/html":["(No data)"],"text/plain":["(No data)"]},"execution_count":5,"metadata":{},"output_type":"execute_result"}],"source":["#to_ship relation extraction\n","graph.run(\"\"\"MATCH (s:Company)-[r:SUPPLIES]->(t:Company)\n","with s, t\n","Match (t)-[l:LOCATED_IN]->(loc:Country)\n","MERGE (s)-[e:SHIP_TO]->(loc)\"\"\")"]},{"cell_type":"code","execution_count":null,"metadata":{"id":"458yH0svWwrf"},"outputs":[],"source":["#Add Weight to the edges based on up-to-dateness of relations\n","graph.run(\"\"\"CALL apoc.periodic.iterate(\"CALL apoc.load.csv('file:///supplier_weights.csv') yield map as line return line\",\n","\"WITH toInteger(line.source_id) AS sID, toInteger(line.target_id) AS tID,toInteger(line.time_weight) as weight\n","match (n:Company{id:sID})-[r:SUPPLIES]->(t:Company{id:tID})\n","set r.weight=weight\",{batchSize:1000, iterateList:true,parallel:false})\"\"\")"]},{"cell_type":"code","execution_count":null,"metadata":{"id":"0qD8VmsxWwrg"},"outputs":[],"source":["## Add Inductive split masks\n","#train mask %70\n","graph.run(\"\"\"match (n:Company)\n","with n, rand()>0.7 as rand\n","set n.trainmask=rand\"\"\")\n","#train split\n","graph.run(\"\"\"match (n:Company{trainmask:True})-[r]-(m:Company{trainmask:True})\n","return n.id, type(r), m.id\"\"\")"]}],"metadata":{"kernelspec":{"display_name":"Python 3 (ipykernel)","language":"python","name":"python3"},"language_info":{"codemirror_mode":{"name":"ipython","version":3},"file_extension":".py","mimetype":"text/x-python","name":"python","nbconvert_exporter":"python","pygments_lexer":"ipython3","version":"3.10.9"},"colab":{"provenance":[]}},"nbformat":4,"nbformat_minor":0}